<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"dc5a1124e9cb2a48cc06d2a4c8174dd27aea984c2fbb5abb2e9f86d68d8eb101","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #891 at https://github.com/cal-itp/data-infra/actions/runs/19041875728","plan_out_hash":"a6bbafec6a16917b4c9a190c5807ddf671c35ab436a372f2bdcbaf3d241eb8df","plan_hash":"617426077c7e84ea19eabebb8533ed1d6d54c75f39bb219766e086e64f5cc9fb","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 4 to change, 10 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "Z+nINw==" -> (known after apply)
!~      detect_md5hash      = "oztTJY65DeqKvihHgQQiAQ==" -> "different hash"
!~      generation          = 1761769654941394 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "oztTJY65DeqKvihHgQQiAQ==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/ntd/_mart_ntd.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "r47K2Q==" -> (known after apply)
!~      detect_md5hash      = "sASLeML+5mjsFq77/CmICg==" -> "different hash"
!~      generation          = 1751416670017954 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/ntd/_mart_ntd.yml"
!~      md5hash             = "sASLeML+5mjsFq77/CmICg==" -> (known after apply)
        name                = "data/warehouse/models/mart/ntd/_mart_ntd.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/ntd/dim_monthly_ridership_with_adjustments.sql"] will be destroyed
  # (because key ["models/mart/ntd/dim_monthly_ridership_with_adjustments.sql"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-composer-dags" {
-       bucket              = "calitp-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "8axD6Q==" -> null
-       detect_md5hash      = "4LJK6HNKut3HcTpfuQq9Mw==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751416663807091 -> null
-       id                  = "calitp-composer-data/warehouse/models/mart/ntd/dim_monthly_ridership_with_adjustments.sql" -> null
-       md5hash             = "4LJK6HNKut3HcTpfuQq9Mw==" -> null
-       md5hexhash          = "e0b24ae8734abaddc7713a5fb90abd33" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd%2Fdim_monthly_ridership_with_adjustments.sql?generation=1751416663807091&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/models/mart/ntd/dim_monthly_ridership_with_adjustments.sql" -> null
-       output_name         = "data/warehouse/models/mart/ntd/dim_monthly_ridership_with_adjustments.sql" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd%2Fdim_monthly_ridership_with_adjustments.sql" -> null
-       source              = "../../../../warehouse/models/mart/ntd/dim_monthly_ridership_with_adjustments.sql" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/ntd_ridership/_mart_ntd_ridership.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "AMaYlg==" -> (known after apply)
!~      detect_md5hash      = "QQRdCtYyan1LQRM5muw5mw==" -> "different hash"
!~      generation          = 1758299289124924 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/ntd_ridership/_mart_ntd_ridership.yml"
!~      md5hash             = "QQRdCtYyan1LQRM5muw5mw==" -> (known after apply)
        name                = "data/warehouse/models/mart/ntd_ridership/_mart_ntd_ridership.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_upt.sql"] will be destroyed
  # (because key ["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_upt.sql"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-composer-dags" {
-       bucket              = "calitp-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "ZGy1EQ==" -> null
-       detect_md5hash      = "wbxIjY/k6eueBc3XuzmBNg==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751416661437231 -> null
-       id                  = "calitp-composer-data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_upt.sql" -> null
-       md5hash             = "wbxIjY/k6eueBc3XuzmBNg==" -> null
-       md5hexhash          = "c1bc488d8fe4e9eb9e05cdd7bb398136" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_upt.sql?generation=1751416661437231&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_upt.sql" -> null
-       output_name         = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_upt.sql" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_upt.sql" -> null
-       source              = "../../../../warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_upt.sql" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_vrm.sql"] will be destroyed
  # (because key ["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_vrm.sql"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-composer-dags" {
-       bucket              = "calitp-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "shpfAg==" -> null
-       detect_md5hash      = "7XLnWh5Ih8ZHck9CDyJQVg==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751416666362049 -> null
-       id                  = "calitp-composer-data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_vrm.sql" -> null
-       md5hash             = "7XLnWh5Ih8ZHck9CDyJQVg==" -> null
-       md5hexhash          = "ed72e75a1e4887c647724f420f225056" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_vrm.sql?generation=1751416666362049&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_vrm.sql" -> null
-       output_name         = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_vrm.sql" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_vrm.sql" -> null
-       source              = "../../../../warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__calendar_year_vrm.sql" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__master.sql"] will be destroyed
  # (because key ["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__master.sql"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-composer-dags" {
-       bucket              = "calitp-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "OUDGew==" -> null
-       detect_md5hash      = "I8Lkjcemze7liHIVcaMEKQ==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751416668963897 -> null
-       id                  = "calitp-composer-data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__master.sql" -> null
-       md5hash             = "I8Lkjcemze7liHIVcaMEKQ==" -> null
-       md5hexhash          = "23c2e48dc7a6cdeee588721571a30429" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__master.sql?generation=1751416668963897&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__master.sql" -> null
-       output_name         = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__master.sql" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__master.sql" -> null
-       source              = "../../../../warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__master.sql" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__upt.sql"] will be destroyed
  # (because key ["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__upt.sql"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-composer-dags" {
-       bucket              = "calitp-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "4nyh/A==" -> null
-       detect_md5hash      = "Hc2ykZfyT9/AGWbBZNDq6A==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751416662386738 -> null
-       id                  = "calitp-composer-data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__upt.sql" -> null
-       md5hash             = "Hc2ykZfyT9/AGWbBZNDq6A==" -> null
-       md5hexhash          = "1dcdb29197f24fdfc01966c164d0eae8" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__upt.sql?generation=1751416662386738&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__upt.sql" -> null
-       output_name         = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__upt.sql" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__upt.sql" -> null
-       source              = "../../../../warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__upt.sql" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__upt_estimates.sql"] will be destroyed
  # (because key ["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__upt_estimates.sql"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-composer-dags" {
-       bucket              = "calitp-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "gKsXYg==" -> null
-       detect_md5hash      = "/Nsqs/s5LgKiVuW0Dxl6cw==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751416662205920 -> null
-       id                  = "calitp-composer-data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__upt_estimates.sql" -> null
-       md5hash             = "/Nsqs/s5LgKiVuW0Dxl6cw==" -> null
-       md5hexhash          = "fcdb2ab3fb392e02a256e5b40f197a73" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__upt_estimates.sql?generation=1751416662205920&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__upt_estimates.sql" -> null
-       output_name         = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__upt_estimates.sql" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__upt_estimates.sql" -> null
-       source              = "../../../../warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__upt_estimates.sql" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__voms.sql"] will be destroyed
  # (because key ["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__voms.sql"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-composer-dags" {
-       bucket              = "calitp-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "NpzGHA==" -> null
-       detect_md5hash      = "5ca5C7bceJvi5UEumz/kCA==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751416670298446 -> null
-       id                  = "calitp-composer-data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__voms.sql" -> null
-       md5hash             = "5ca5C7bceJvi5UEumz/kCA==" -> null
-       md5hexhash          = "e5c6b90bb6dc789be2e5412e9b3fe408" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__voms.sql?generation=1751416670298446&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__voms.sql" -> null
-       output_name         = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__voms.sql" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__voms.sql" -> null
-       source              = "../../../../warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__voms.sql" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrh.sql"] will be destroyed
  # (because key ["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrh.sql"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-composer-dags" {
-       bucket              = "calitp-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "3VyUvw==" -> null
-       detect_md5hash      = "VPh+cvIDJQpf0dmlYViMBQ==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751416663320059 -> null
-       id                  = "calitp-composer-data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrh.sql" -> null
-       md5hash             = "VPh+cvIDJQpf0dmlYViMBQ==" -> null
-       md5hexhash          = "54f87e72f203250a5fd1d9a561588c05" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__vrh.sql?generation=1751416663320059&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrh.sql" -> null
-       output_name         = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrh.sql" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__vrh.sql" -> null
-       source              = "../../../../warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrh.sql" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrm.sql"] will be destroyed
  # (because key ["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrm.sql"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-composer-dags" {
-       bucket              = "calitp-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "RwZ1SQ==" -> null
-       detect_md5hash      = "CZPoozmsKRg7lNftU8dekA==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751416666943674 -> null
-       id                  = "calitp-composer-data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrm.sql" -> null
-       md5hash             = "CZPoozmsKRg7lNftU8dekA==" -> null
-       md5hexhash          = "0993e8a339ac29183b94d7ed53c75e90" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__vrm.sql?generation=1751416666943674&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrm.sql" -> null
-       output_name         = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrm.sql" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__vrm.sql" -> null
-       source              = "../../../../warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrm.sql" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrm_estimates.sql"] will be destroyed
  # (because key ["models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrm_estimates.sql"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-composer-dags" {
-       bucket              = "calitp-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "+JOZsg==" -> null
-       detect_md5hash      = "rawLwrhKQGPd32yUL0Z1Fw==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751416664346274 -> null
-       id                  = "calitp-composer-data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrm_estimates.sql" -> null
-       md5hash             = "rawLwrhKQGPd32yUL0Z1Fw==" -> null
-       md5hexhash          = "adac0bc2b84a4063dddf6c942f467517" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__vrm_estimates.sql?generation=1751416664346274&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrm_estimates.sql" -> null
-       output_name         = "data/warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrm_estimates.sql" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fntd_ridership%2Ffct_complete_monthly_ridership_with_adjustments_and_estimates__vrm_estimates.sql" -> null
-       source              = "../../../../warehouse/models/mart/ntd_ridership/fct_complete_monthly_ridership_with_adjustments_and_estimates__vrm_estimates.sql" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "qfwvow==" -> (known after apply)
!~      detect_md5hash      = "1cJlOr5NQvragutOKHNfgg==" -> "different hash"
!~      generation          = 1761769656597758 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "1cJlOr5NQvragutOKHNfgg==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 10 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #891](https://github.com/cal-itp/data-infra/actions/runs/19041875728)